Repository: RotomDaPesteBR/Utils
Catalog: Core/Utils.Results/Resources/ErrorMessages.*.resx
Languages: pt_br

# Application_InternalError
source: An internal error occurred.
pt_br: Ocorreu um erro interno.

# Application_ValidationError
source: A validation error occurred.
pt_br: Ocorreu um erro de validação.

# Application_NotFound
source: The requested resource was not found.
pt_br: O recurso solicitado não foi encontrado.

# Application_InvalidOperation
source: The requested operation is invalid in the current state of the system.
pt_br: A operação solicitada é inválida no estado atual do sistema.

# Application_TaskCanceled
source: The operation was canceled.
pt_br: A operação foi cancelada.

# Application_NotImplemented
source: The feature has not been implemented yet.
pt_br: A funcionalidade ainda não foi implementada.

# Authentication_Unauthorized
source: Unauthorized access. Missing or invalid credentials.
pt_br: Acesso não autorizado. Credenciais ausentes ou inválidas.

# Authentication_Forbidden
source: Access forbidden. Insufficient permission.
pt_br: Acesso proibido. Permissão insuficiente.

# Authentication_TokenExpired
source: The authentication token has expired.
pt_br: O token de autenticação expirou.

# Authentication_InvalidCredentials
source: The provided credentials are invalid.
pt_br: As credenciais fornecidas são inválidas.

# Authentication_InactiveAccount
source: The user account is inactive.
pt_br: A conta de usuário está inativa.

# Authentication_ExpiredSession
source: The user session has expired.
pt_br: A sessão de usuário expirou.

# Concurrency_Conflict
source: Concurrency conflict detected.
pt_br: Conflito de concorrência detectado.

# Concurrency_Locked
source: The resource is locked by another process.
pt_br: O recurso está bloqueado por outro processo.

# Concurrency_StaleData
source: Data is outdated due to concurrency.
pt_br: Os dados estão desatualizados devido à concorrência.

# Concurrency_ResourceInUse
source: The resource is already in use by another operation.
pt_br: O recurso já está em uso por outra operação.

# Database_ConnectionFailed
source: Failed to connect to the database.
pt_br: Falha ao conectar ao banco de dados.

# Database_QueryExecutionFailed
source: Failed to execute query in the database.
pt_br: Falha ao executar consulta no banco de dados.

source: Database constraint violation.
pt_br: Violação de restrição do banco de dados.

# Database_Transient
source: Temporary database error. Please try again.
pt_br: Erro temporário do banco de dados. Tente novamente.

# Database_Deadlock
source: A deadlock occurred.
pt_br: Ocorreu um deadlock.

# External_RateLimitExceeded
source: Request limit exceeded.
pt_br: Limite de requisições excedido.

# External_ApiQuotaExceeded
source: API quota exceeded.
pt_br: Cota de API excedida.

# External_InvalidApiResponse
source: Invalid external API response.
pt_br: Resposta inválida da API externa.

# External_ServiceUnavailable
source: The requested service is currently unavailable.
pt_br: O serviço solicitado não está disponível no momento.

# External_Timeout
source: The request to the external service timed out.
pt_br: A requisição para o serviço externo atingiu o tempo limite.

# External_Communication
source: Communication failure with the external service.
pt_br: Falha de comunicação com o serviço externo.

# IO_FileNotFound
source: The specified file was not found.
pt_br: O arquivo especificado não foi encontrado.

# IO_PermissionDenied
source: Permission denied to access the file or directory.
pt_br: Permissão negada para acessar o arquivo ou diretório.

# IO_CorruptedFile
source: The file is corrupted or unreadable.
pt_br: O arquivo está corrompido ou ilegível.

# IO_DiskFull
source: There is not enough space on the disk to complete the operation.
pt_br: Não há espaço suficiente no disco para completar a operação.

# IO_DirectoryNotFound
source: The directory path was not found.
pt_br: O caminho do diretório não foi encontrado.

# Network_ConnectionFailed
source: Failed to connect to the network.
pt_br: Falha ao conectar à rede.

# Network_RequestTimeout
source: Request timeout exceeded.
pt_br: Tempo limite de requisição excedido.

# Network_ServiceUnavailable
source: Network service is currently unavailable.
pt_br: Serviço de rede indisponível no momento.

# Network_DnsFailure
source: Domain name resolution (DNS) failure.
pt_br: Falha na resolução de nome de domínio (DNS).

# Network_SslHandshakeFailed
source: SSL/TLS certificate validation failed.
pt_br: Falha na validação do certificado SSL/TLS.

# Network_ProxyFailure
source: Proxy connection or authentication failed.
pt_br: Falha na conexão ou autenticação do proxy.

# Request_InvalidRequest
source: The request has an invalid format.
pt_br: A requisição possui um formato inválido.

# Request_TooLargeRequest
source: The request payload is too large.
pt_br: A carga da requisição é muito grande.

# Request_TooManyRequests
source: Excessive number of requests.
pt_br: Número excessivo de requisições.

# Request_NotAcceptable
source: The response format is not acceptable.
pt_br: O formato da resposta não é aceitável.

# Request_UnsupportedMediaType
source: The request media type is not supported.
pt_br: O tipo de mídia da requisição não é suportado.

# Resource_NotFound
source: The requested resource was not found.
pt_br: O recurso solicitado não foi encontrado.

# Resource_AlreadyExists
source: The resource already exists.
pt_br: O recurso já existe.

# Resource_Unavailable
source: The resource is currently unavailable.
pt_br: O recurso está indisponível no momento.

# Resource_InvalidState
source: The resource is not in a valid state for the operation.
pt_br: O recurso não está em um estado válido para a operação.

# Resource_Obsolete
source: The requested resource is obsolete or discontinued.
pt_br: O recurso solicitado está obsoleto ou descontinuado.

# System_Configuration
source: Invalid or missing system configuration.
pt_br: Configuração do sistema inválida ou ausente.

# System_DependencyNotRegistered
source: System dependency not registered or missing.
pt_br: Dependência de sistema não registrada ou ausente.

# System_OutOfMemory
source: Not enough memory to complete the operation.
pt_br: Não há memória suficiente para completar a operação.

# System_ThreadAborted
source: The execution thread was aborted.
pt_br: A thread de execução foi abortada.

# System_SystemMaintenance
source: The system is under maintenance.
pt_br: O sistema está em manutenção.

# Validation_InvalidFormat
source: Invalid data format.
pt_br: Formato de dados inválido.

# Validation_InvalidSchema
source: Invalid data schema.
pt_br: Esquema de dados inválido.

# Validation_DeserializationFailed
source: Data deserialization failed.
pt_br: Falha na desserialização dos dados.

# Validation_MissingField
source: One or more required fields are missing.
pt_br: Um ou mais campos obrigatórios estão ausentes.

# Validation_ValueOutOfRange
source: One or more values are out of the allowed range.
pt_br: Um ou mais valores estão fora do intervalo permitido.
